Repository: bryan-souza/HexaPawn
Catalog: docs/locales/*/LC_MESSAGES/install.po
Languages: pt_br

source: Installing
pt_br: Instalação

source: You may need to install some things to test and see by yourself how the AI gets smarter and smarter over time.
pt_br: Você vai precisar instalar algumas coisas para testar e ver por conta própria como a IA fica mais e mais esperta com o tempo.

source: As long as we don't have the binaries to share with you, you'll need to install python 3.6+ in your computer, but don't worry, it's not a complicated thing.
pt_br: Enquanto não tivermos pacotes binários para compartilhar contigo, você precisará instalar o python 3.6+ em seu computador, mas não se preocupe não é uma coisa complicada.

source: Go to the `python <https://www.python.org>`_ and head to the "Downloads" section. Then, select your OS in the list and it'll redirect you to a list of python releases. Download the latest 3.x version and follow the setup installing instructions to get python working on your machine.
pt_br: Vá até o `website do python <https://www.python.org>`_ e encontre a seção "Downloads". Encontre e selecione seu sistema operacional na lista e você será redirecionado para uma página com uma lista de versões do python disponíveis para download. Baixe a última versão 3.x do python e siga as instruções de instalação.

source: If you are using Windows, don't forget to check the "Add to PATH" option while installing, because if you forget to check it, you won't be able to run python console, pip, or any python file in CMD
pt_br: Se você estiver usando Windows, não se esqueça de marcar a opção "Add to PATH" ou "Adicionar ao PATH" quando for instalar, porque se você se esquecer disso, você não conseguirá executar o console python, pip, ou qualquer arquivo python pelo CMD ou PowerShell

source: But I can hear someone say:
pt_br: Eu consigo ouvir alguém dizer:

source: *I can't find Linux in the Downloads section*
pt_br: *Eu não consigo encontrar Linux na seção de Downloads*

source: No need to worry, you'll need to take a different path (a shortcut, if you allow me to say) in order to install python. Here's some examples based on some major linux distros:
pt_br: Não se preocupe, você só terá de tomar um caminho diferente (um atalho, se me permite dizer) para instalar o python. Aqui estão alguns exemplos de como instalar o python nas distribuições Linux mais usadas:

source: To check if python is installed, just open the CMD (Windows) or the console (Linux/Mac) and type
pt_br: Para conferir se o python foi instalado, abra o CMD (Windows) ou o console (Linux/Mac) e digite:

source: You should get a message like "Python 3.x.x" indicating the python version you installed
pt_br: Você deverá receber uma mensagem como "Python 3.x.x" indicando a versão que você acabou de instalar

source: Graphviz is a graph visualization software that we've used to plot all AI generations and it's progress changing over time.
pt_br: O Graphviz é um software para a criação e visualização de grafos que usamos para criar uma visualização gráfica de todas as gerações da IA e como ela vai se modificando ao longo do tempo.

source: You can download it `here <https://www.graphviz.org/>`_ just go to the "Downloads" section and follow along with the instructions. They explain how to install it in Windows, major linux distros and Mac.
pt_br: Você pode baixá-lo `aqui <https://www.graphviz.org/>`_ na seção de "Downloads". Apenas siga as instruções no próprio website, onde é explicado como instalá-lo no Windows, distribuições Linux e Mac.

source: Sphinx is an optional requirement, needed only if you want to build the documentation locally. Otherwise you can find it online at `our Read The Docs page <https://hexapawn.readthedocs.io/en/stable/index.html>`_
pt_br: Sphinx é um requisito opcional, somente necessário se você quiser construir a documentação localmente. De todo modo, é possível encontrar a documentação

source: To install sphinx, simply run the command:
pt_br: Para instalar o Sphinx, execute o comando:

source: If you are using Mac/Linux or any other UNIX-like system, you may need to install `Make <https://www.gnu.org/software/make/>`_
pt_br: Se você estiver usando Mac ou Linux ou qualquer outro sistema baseado em UNIX, você precisará instalar o pacote `Make <https://www.gnu.org/software/make/>`_

source: To build the documentation:
pt_br: Para construir a documentação:

source: If everything goes fine, you'll see a new folder inside the ``docs`` folder called ``build/html``, where sphinx put the HTML files and other resources.
pt_br: Se tudo correr bem, você verá uma nova pasta dentro da pasta ``docs`` chamada ``build/html``, que é onde o Sphinx coloca os arquivos HTML e demais recursos da documentação.

source: `Sphinx tutorial <https://www.sphinx-doc.org/en/master/tutorial/index.html>`_ for further information about documentation building process
pt_br: Tutorial do Sphinx <https://www.sphinx-doc.org/en/master/tutorial/index.html>`_ para mais infomações sobre o processo de construção da documentação

source: PIP Requirements
pt_br: Requisitos do PIP

source: Now that you have all third-party software up and running in your computer, you'll have to install python package dependencies. Fortunately, we've made a PIP package listing for you.
pt_br: Agora que você já possui todos os softwares de terceiros rodando em seu computador, você deverá instalar as dependencies do python.Felizmente, nós fizemos uma lista de dependencies do PIP para você.

source: Just open the terminal/CMD, go to the folder where you extracted/cloned the git repo and type:
pt_br: Abra o terminal ou CMD, vá até a pasta onde você extraiu ou clonou o

source: You should see the PIP fetching the packages and automatically installing it for you.
pt_br: Você deverá ver o PIP baixando e instalando os pacotes automaticamente.

source: Now simply run the ``main.py`` file:
pt_br: Agora execute o arquivo ``main.py``:

source: And yay, it works! (or doesn't, i dunno)
pt_br: E funciona! (ou não, não sei)
