Repository: bryan-souza/HexaPawn
Catalog: docs/locales/*/LC_MESSAGES/learning.po
Languages: pt_br

source: Learning to learn
pt_br: Aprendendo a aprender

source: In this section, I'll explain more about how the AI can learn by playing with you. I've used 3 types of "learning algorithms" in this project: ``Inclusive``, ``Exclusive`` and ``Both``. When you open the game, you can change the default algorithm and see how their graphs differ from each other. If you're lazy and don't want to lose to my fearsome AI, that's okay (even I am tired of losing that thing), just stick with me and you'll understand the magic behind the monster.
pt_br: Nessa seção, eu explicarei mais sobre como a IA pode aprender jogando com você. Eu usei 3 tipos de "algoritmos de aprendizado" nesse projeto: ``Inclusivo``, ``Exclusivo`` e ``Ambos``. Quando abrir o jogo, você pode mudar o algoritmo padrão e ver como os grafos se diferenciam entre si. Se você estiver com preguiça e não quer perder para minha temível IA, tranquilo (até mesmo eu estou cansado de perder para aquela coisa), apenas continue lendo e você vai entender a magia por detrás do monstro.

source: How do humans learn?
pt_br: Como os humanos aprendem?

source: Remember when you was a kid and you wanted so much that bar of chocolate, but your mom said: "NO!"? At that moment, you learned that sometimes, you can't have everything you want whenever you want. That's one way we lovely humans can learn, but there are another ways (just two, to be honest) that are more interesting if you think like a programmer.
pt_br: Lembra quando você era uma criança e você queria muito aquela barra de chocolate, mas sua mãe disse: "Não!"? Naquele momento, você aprendeu que às vezes não se pode ter tudo quando queremos. Essa é uma maneira que nós amáveis humanos, na qual podemos aprender, mas existem outras maneiras (apenas duas pra ser honesto) que são mais interessantes se você pensar como um programador.

source: The first one is the learning by reward. This kind of happens every year when an entity called "Santa Claus" rewards children based on their behaviour along the year. If you were a good boy/girl, you were rewarded with a new bicycle, a brand new `Nintendo 64 <https://www.youtube.com/watch?v=pFlcqWQVVuU>`_ (pun intended), or anything like that. After opening the presents under the christmas tree, you learn that being a nice person can be rewarding, so you'll look forward being a nice person every year.
pt_br: O primeiro método é o aprendizado pela recompensa. Esse tipo acontece todos os anos quando uma entidade chamada "Papai Noel" presenteia as crianças baseado no seu comportamento ao longo do ano. Se você foi um(a) bom(a) garoto(a), você será recompensado com uma bicicleta nova, um `Nin`tendo 64 "<https://www.youtube.com/watch?v=pFlcqWQVVuU>`_ novinho (era pra ser engraçado, ok?), ou algo do tipo. Depois de abrir os presentes debaixo da árvore de natal, você aprende que ser uma boa pessoa pode ser recompensador, então você vai buscar ser uma pessoa boa todos os anos.

source: Keeping up with the christmas example (and spirit :D), the other way of learning is based on punishment. Remember when I said that only the good boys/girls won cool presents? That's right, the bad boys/girls don't get anything, but their friends do. And when they go outside to play and see the cool things their neighbors got by just being nice, they may be tempted to change their behaviour the next year and get some presents too (or they may get mad at Mr. Santa Claus, start growing green hair and change their names to *Grinch*).
pt_br: Continuando com o exemplo de natal (e espírito também :D), a outra maneira de se aprender é baseado na punição. Lembra quando eu disse que somente as crianças boas ganhavam presentes legais? Pois é, as crianças más não ganhavam nada, mas seus amigos sim. E quando eles iam brincar lá fora e viam as coisas legais que seus vizinhos tinham ganhado só por terem sido pessoas boas, eles podem ficar tentados a mudar seu comportamento no próximo ano e ganhar algum presente também (ou eles podem ficar com ódio do Sr. Papai Noel, começarem a criar pelos verdes pelo corpo e mudarem seus nomes para *Grinch*).

source: Meet Mr. Hippocampus
pt_br: Conheça o Sr. Hipocampo

source: Well, now that you know about how the human learning process works, you shall teach your computer how to learn too.
pt_br: Bom, agora que você sabe como funciona o processo de aprendizado humano, você deve ensinar seu computador como aprender também.

source: To start simple, we'll pick the game of hexapawn as a learning base. The main reason for this is that hexapawn's moves are pretty simple to predict, and by knowing every single way that the game may end, helps like, a lot, because you can see if your AI is truly learning how to play or not.
pt_br: Para começar com algo simples, nós usaremos o jogo hexapawn como uma base de aprendizado. O principal motivo para tal é que os movimentos do hexapawn são bem fáceis de prever, e sabendo todas as formas na qual o jogo pode acabar, ajuda muito, porque assim você pode ver se sua IA está aprendendo como jogar ou não.

source: So, let's start by calculating all game moves:
pt_br: Então, vamos começar calculando todos os movimentos possíveis:

source: That's a lot of code right? But don't worry, it's actually pretty simple to understand.
pt_br: É bastante código né? Mas não se preocupe, é bem simples de entender

source: When started, the function will simulate the game state based on the given movecode using the ``self.judge`` object within the Ai class. The judge will execute the given movecode and then, the algorithm will check all possible capture movements for the opposing color (if the last move was a white pawn move, it'll check for all possible moves for the black pawns, and so on), generating a list of strings (movecodes). Then, the algorithm will run the ``__make_nodes()`` function again, carrying the given movecode plus one member of the children list (the list of possible moves) and do all this process again and again, until it reaches a leaf (a game state where someone win). In this case, it'll return a Node object containing no children at all, which causes the application call stack (its PROGRAM CALL STACK, not MOVE CALL STACK. They're very different things) to go back one level (the process is kept open until all possible trees have been solved, i.e. reached a leaf) and solve the next children (sorry, I can't explain how a function that keeps calling itself until some condition is met properly).
pt_br: Quando executada, a função vai simular o estado do jogo baseado no movecode que foi passado como parâmetro usando o objeto ``self.judge`` contido dentro da classe ``Ai``. O juiz irá executar o movecode e aí, o algoritmo vai calcular todos os movimentos possíveis da cor oposta (se o último movimento foi das brancas, o algoritmo vai checar calcular todos os movimentos das pretas, e assim por diante), gerando uma lista de strings (movecodes). Depois, o algoritmo vai executar a função ``__make_nodes()`` novamente, levando como parâmetros o movecode dado somado a um membro da lista de filhos (a lista de moviemntos possíveis) e repetir esse processo denovo e denovo, até que ele chegue em um vértice folha (um estado de jogo em que alguém ganha). Nese caso, ele vai retornar um objeto Node contendo nenhum filho, o que causa a pilha de chamadas da aplicação (favor não confundir com a pilha de chamada de movimentos. Eles são coisas totalmente diferentes) voltar um nível abaixo (o processo é mantido rodando até que todas as árvores de movimento possíveis tenham sido resolvidas, ou seja, chegado a um vértice folha) e só então resolve o próximo filho (desculpe, eu não consigo explicar adequadamente como uma função que invoca a si mesma até que uma condição seja satisfeita).

source: When all trees. subtrees, nodes and leaves are found, tested and computed, you get that crazy image that you saw in the last chapter.
pt_br: Quando todas as árvores, subárvores, vértices e folhas forem encontradas, testadas e computadas, você vai obter aquela imagem louca que viu no capítulo anterior.

source: If you understood what I tried to say above, congratulations, you teached your computer how to remember things and gave it some kind of "brain". The only sad part is that it'll "think" randomly and will never become self sentient and conquer the world.
pt_br: Se você entendeu o que eu tentei dizer acima, meus parabéns, você ensinou seu computador como lembrar coisas e o deu um tipo de "cérebro". A parte triste disso tudo é que ele irá "pensar" aleatóriamente e nunca vai se tornar autoconsciente e dominar o mundo.

source: Mitosis
pt_br: Mitose

source: *Cell division time! Yay.*
pt_br: *Hora da divisão celular! Aeee.*

source: Well, not really.
pt_br: Não é bem por aí.

source: Remember when I mentioned an "Inclusive" learning method? It's very similar to cell division and duplication (a. k. a. Mitosis).
pt_br: Lembra quando eu mencionei um método de aprendizado "inclusivo"? É bem similar ao processo de divisão e duplicação celular (mitose).

source: Imagine that the "brain" that we gave to our little frankenstein is made of genuine biological cells. Now imagine that everytime a cell is identified as "good", the brain forces it to make mitosis and create clones of that cell, so your brain will incompusively use them more often and making the chance of them being chosen greater. (just imagine, because that's not what really happens under the hood when you learn something).
pt_br: Imagine que o "cérebro" que demos ao nosso pequeno frankenstein é feito de células biológicas genuínas. Agora imagine que toda vez que uma célula for identificada como "boa", o cérebro força ela a fazer mitose e criar um clone daquela célula, para que o cérebro incompulsivamente use elas com maior frequência e faça com que a chance delas serem escolhidas seja maior (apenas imagine, porque não é bem isso que acontece com seu cérebro quando você aprende algo novo).

source: Well, yes, this is in fact a way of learning, but there's one big problem with it: the chances of choosing a "bad" node is minimal, but never zero, because the bad nodes are kept inside the brain, and it may be randomly picked by the AI. So this may work, but it's not the best option if you want a 100% accurate AI to play with.
pt_br: Bem, sim, esse é de fato um meio de aprender, mas há um grande problema com ele: as chances de escolher uma célula "ruim" se torna mínima, mas nunca se torna zero, porque os vértices ruins são mantidos no cérebro, e podem ser escolhidos ao acaso pela IA. Então, a IA pode até funcionar desse jeito, mas não é a melhor opção se você deseja criar uma IA com 100% de precisão para jogar contra.

source: So let's meet Mrs. Lobotomy
pt_br: Então vamos conhecer a Sra. Lobotomia

source: Lobotomy
pt_br: Lobotomia

source: For those who don't know, lobotomy is a neurological surgery which gets your hippocampus (long-term memory) removed from your brain. The analogy works here too. Remember the "Exclusive" method? That's right, cutting time!
pt_br: Para aqueles que não sabem, lobotomia é um procedimento cirúrgico neurológico no qual é feita a remoção do seu hipocampo (sua memória de longo prazo) do seu cérebro. A analogia funciona aqui também. Lembra do método "exclusivo"? Isso mesmo, hora de cortar!

source: This method will remove every single cell that is identified as "bad" from the brain, preventing it to make errors. So every time a losing node is identified, it'll be removed from the "brain" and will no longer be possible to be made by the Ai.
pt_br: Esse método irá remover toda e qualquer célula que for identificada como "ruim" do cérebro, prevenindo-o de cometer erros. Então toda vez que um vértice que resulta em uma derrota das pretas for encontrado, ele será removido do "cérebro" e a IA não poderá mais executar aquele movimento novamente quando aquele estado de jogo for alcançado.

source: Sounds a lot better than mitosis, right?
pt_br: Soa bem melhor que a mitose, certo?

source: Well, it is and it isn't. Sure, it prevents the Ai to repeat the same errors every time, but takes a lot of time to test and find every single game possibility, thus creating the perfect hexapawn Ai.
pt_br: Bom, ele é e não é. Certo, ele previne a IA de cometer os mesmos erros toda vez, mas requer muito tempo para testar todas as possibilidades,

source: But what if we mix and match both methods?
pt_br: Mas e se pudéssemos combinar os dois métodos?

source: Two-Face (a. k. a. Harvey Dent)
pt_br: Duas Caras (também conhecido como Harvey Dent)

source: By mixing both methods, our AI will be capable of removing the nodes that result in a loss, while duplicating nodes that result in a win. So we are basically decreasing the rate of error and increasing our chance of winning at the same time, cool isn't it? Just be sure Mr. Dent over here gets too cocky and stars flipping coins to decide which color wins and which color loses; if that happens: call the Bats right away!
pt_br: Combinando os dois métodos, nossa IA será capaz de remover vértices que resultam em derrota, enquanto duplica os vértices que resultam em vitória. Então nós estamos basicamente diminuindo a taxa de erro e aumentando a chance de acerto ao mesmo tempo, legal né? Só se certifique de que o Sr. Dent aqui não fique muito excitado e comece a jogar "cara ou coroa" para decidir qual cor ganha e qual cor perde; se isso acontecer, chame o morcegão na hora!

source: Final Thoughts
pt_br: Conclusão

source: I hope you understood what i tried to say about the learning process of this AI, and if you want my advice: test it, and test it *a lot*. Enable plotting in the `config.json` file and see for yourself how the AI's "brain" changes throughout the generations! It's a cool experience, even better when you understand what is happening and why it's happening.
pt_br: Eu espero que você tenha entendido o que tentei explicar sobre o processo de aprendizagem dessa IA, e se quer um conselho: teste, e teste *muito*. Habilite as funções gráficas no arquivo `config.json` e veja por conta própria como o "cérebro" da IA se modifica ao longo das gerações! É uma experiência legal, melhor ainda quando você entende o que está acontecendo e porque está acontecendo.
