Repository: bryan-souza/HexaPawn
Catalog: docs/locales/*/LC_MESSAGES/tree.po
Languages: pt_br

source: Nodes, Leaves and Trees
pt_br: Vértices, Folhas e Árvores

source: Trees
pt_br: Árvores

source: The first core concept you'll need to understand is how Trees work. And no, I'm not talking about organic trees, I'm talking about coded trees. If you run the game, play for a little while, then check the ``plots`` folder, you'll see something like this:
pt_br: O primeiro conceito-chave que você terá de entender é como árvores funcionam. E não, não estou falando sobre árvores orgânicas, estou falando sobre árvores programadas. Se você executar o jogo, jogar um pouco e depois der uma olhada na pasta ``plots``, você verá algo parecido com isso:

source: Then you may be thinking: *"WTF is this??"*
pt_br: Você deve estar pensando: *"O que diabos é isso??"*

source: This, although it may not seem, it is a coded tree (well, not really, this is in fact a graphical representation of a coded tree). This tree represents all game movements and its respective children (the moves that can be made at the given move state). TL;DR: A tree is a collection of nodes, which indicates the last move and the color that made it, and which moves can be made after that.
pt_br: Isso, apesar de não parecer, é uma árvore programada (bem, não exatamente, isso é na verdade uma representação gráfica de uma árvore programada). Essa árvore representa todos os movimentos possíveis em um jogo de hexapawn e todos os seus filhos (os movimentos que podem ser feitos quando o jogo se encontra nesse estado). Resumindo: uma árvore é uma coleção de vértices, que indicam o último movimento realizado e a cor do peão que o fez, e quais movimentos podem ser feitos depois disso.

source: Nodes & Leaves
pt_br: Vértices & Folhas

source: Nodes are basically variables that store the last move and all movements that can be made at the given game state. If you check the code, you'll see at the ``ai.py`` module, this code piece:
pt_br: Vértices são basicamente variáveis que armazenam o último movimento e todos os movimentos que podem ser feitos no dado estado de jogo. Se você der uma olhada no código, você verá no módulo ``ai.py``, esse pedaço de código:

source: This code creates instances of Node objects that store the infos we've already covered.
pt_br: Esse código cria instâncias de objetos Node que armazenam as informações que já comentamos sobre.

source: *So what?*
pt_br: *Tá. Mas e daí?*

source: Nodes are Node objects that have anything different than an empty list ([]) as its ``children`` parameter. When it's not an empty list, it should be filled with pre calculated move possibilites, represented by their respective movecodes.
pt_br: Vértices são objetos Node que possuem qualquer coisa diferente de uma lista vazia ([]) como parâmetro ``children`` (filhos). Quando o parâmetro não é vazio, ele deve ser uma lista de movimentos possíveis pré-calculados, representados pelos seus respectivos códigos (movecodes)

source: When the children parameter equals to an empty list, this means that this node is an end node, a. k. a. Leaf. What this really means is that, after this node, no move can be made anymore, because one of the sides has won, causing a game reset.
pt_br: Quando o parâmetro ``children`` está vazio, isso significa que esse vértice é um vértice final, também conhecido como Folha. O que isso realmente significa é que, após esse vértice, nenhum outro movimento pode ser realizado, porque um dos lados ganhou, causando um reset.

source: But these concepts are completely relative to the move call stack, because a node can turn into a leaf, and a leaf can turn into a node, depending on how the game evolves. Consider this:
pt_br: Mas esses conceitos são totalmente relativos á pilha de chamadas de movimento, porque um vértice pode se tornar uma folha, e uma folha se tornar um vértice, dependendo de como o jogo evolui. Considere isso:

source: In this example, there's only one node and two leaves, and their role never changes, but in a game of hexapawn, the roles of nodes and leaves can change quite a lot, so I'll add some more nodes and roots, and you'll see what I mean.
pt_br: Nesse exemplo, só há um vértice e duas folhas, e seus papéis nunca mudam, mas em um jogo de hexapawn, os papéis dos vértices e das folhas podem mudar bastante, então eu vou adicionar mais vértices, e você vai entender o que quero dizer.

source: As you can see, depending on how the call stack is filled, the nodes may assume different roles. The ``node1`` behaves as a node if you're coming from the ``root1`` or ``root3``, but it becomes a leaf if you pick ``root2``. The same happens with ``node2``: it can be a node if you pick ``root3``, but it becomes a leaf if you pick ``root1``.
pt_br: Como você pode ver, dependendo de como a pilha de chamadas é preenchida, os vértices podem assumir differentes papéis. O ``node1`` se comporta como vértice se você escolher a rota partindo de ``root1`` ou ``root3``, mas ele se torna uma folha se você escolher ``root2``. O mesmo acontece com ``node2``: ele pode ser um vértice se você escolher o caminho partindo de ``root3``, mas se torna uma folha se você escolher ``root1``.
